// 鸣潮 - 尤诺角色数据

import { Character } from "@/types";

export const YOUNUO: Character = {
  baseStats: {
    name: "尤诺",
    rarity: 5,
    weaponType: "臂铠",
    elementType: "气动伤害",
    
    level: 90,
    levelList: [20, 40, 50, 60, 70, 80, 90],
    
    baseHPList: [2190,4170,5441,6712,7983,9254,10525],
    baseATKList: [93,181,238,295,353,401,450],
    baseDEFList: [236,447,582,718,853,989,1124],
    
    baseCritRate: 0.05,
    baseCritDMG: 1.50,
    baseHealBonus: 0,
    baseElementDMG: 0.12,
    baseEnergyRegen: 1.00,
    
    imageKey: "younuo"
  },
  
  skills: [
    // ========== 常态攻击==========
  {
    name: "月环·普攻第一段伤害",
    skillLevel: 10,
    damageType: "普攻",
    skillCategory: "常态攻击",
    multiplierList: [0.4410,0.4772,0.5134,0.5640,0.6002,0.6417,0.6996,0.7575,0.8153,0.8768],
  },
  {
    name: "月环·普攻第二段伤害",
    skillLevel: 10,
    damageType: "普攻",
    skillCategory: "常态攻击",
    multiplierList: [0.2317*2+0.2387,0.2507*2+0.2583,0.2697*2+0.2779,0.2963*2+0.3053,0.3153*2+0.3248,0.3371*2+0.3474,0.3675*2+0.3787,0.3979*2+0.4100,0.4283*2+0.4413,0.4606*2+0.4746],
  },
  {
    name: "月环·普攻第三段伤害",
    skillLevel: 10,
    damageType: "普攻",
    skillCategory: "常态攻击",
    multiplierList: [0.4426*2+0.4560,0.4789*2+0.4934,0.5152*2+0.5308,0.5660*2+0.5831,0.6022*2+0.6205,0.6440*2+0.6635,0.7020*2+0.7233,0.7601*2+0.7831,0.8182*2+0.8429,0.8798*2+0.9065],
  },
  {
    name: "月环·空中攻击",
    skillLevel: 10,
    damageType: "普攻",
    skillCategory: "常态攻击",
    multiplierList: [0.2700*2,0.2922*2,0.3143*2,0.3453*2,0.3675*2,0.3929*2,0.4284*2,0.4638*2,0.4992*2,0.5368*2],
  },
  {
    name: "月环·闪避反击",
    skillLevel: 10,
    damageType: "普攻",
    skillCategory: "常态攻击",
    multiplierList: [0.4129*2+0.4254,0.4467*2+0.4603,0.4806*2+0.4951,0.5280*2+0.5440,0.5618*2+0.5789,0.6008*2+0.6190,0.6549*2+0.6748,0.7091*2+0.7306,0.7632*2+0.7864,0.8208*2+0.8457],
  },
  {
    name: "月弓·普攻第一段伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "常态攻击",
    multiplierList: [0.6360,0.6882,0.7404,0.8134,0.8655,0.9255,1.0089,1.0924,1.1758,1.2645],
  },
  {
    name: "月弓·普攻第二段伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "常态攻击",
    multiplierList: [0.2800*3,0.3030*3,0.3260*3,0.3581*3,0.3811*3,0.4075*3,0.4442*3,0.4809*3,0.5177*3,0.5567*3],
  },
  {
    name: "月弓·普攻第三段伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "常态攻击",
    multiplierList: [0.8400*2,0.9089*2,0.9778*2,1.0742*2,1.1431*2,1.2223*2,1.3325*2,1.4427*2,1.5530*2,1.6701*2],
  },
  {
    name: "月弓·闪避反击伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "常态攻击",
    multiplierList: [0.5200*3,0.5627*3,0.6053*3,0.6650*3,0.7077*3,0.7567*3,0.8249*3,0.8931*3,0.9614*3,1.0339*3],
  },
      
    // ========== 共鸣技能==========
  {
    name: "原初的律动伤害",
    skillLevel: 10,
    damageType: "共鸣技能",
    skillCategory: "共鸣技能",
    multiplierList: [0.0938*7+0.6565,0.1015*7+0.7104,0.1092*7+0.7642,0.1200*7+0.8396,0.1277*7+0.8934,0.1365*7+0.9553,0.1488*7+1.0415,0.1611*7+1.1276,0.1734*7+1.2137,0.1865*7+1.3052],
  },
  {
    name: "告终的喧响伤害",
    skillLevel: 10,
    damageType: "共鸣技能",
    skillCategory: "共鸣技能",
    multiplierList: [0.7079*2+0.7293,0.7659*2+0.7892,0.8240*2+0.8490,0.9052*2+0.9327,0.9633*2+0.9925,1.0300*2+1.0613,1.1229*2+1.1569,1.2158*2+1.2526,1.3087*2+1.3483,1.4073*2+1.4500],
  },
  {
    name: "未终的喧响伤害",
    skillLevel: 10,
    damageType: "共鸣技能",
    skillCategory: "共鸣技能",
    multiplierList: [0.7079*2+0.7293,0.7659*2+0.7892,0.8240*2+0.8490,0.9052*2+0.9327,0.9633*2+0.9925,1.0300*2+1.0613,1.1229*2+1.1569,1.2158*2+1.2526,1.3087*2+1.3483,1.4073*2+1.4500],
  },
  {
    name: "越限的弦引伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣技能",
    multiplierList: [1.1055*2,1.1962*2,1.2869*2,1.4138*2,1.5044*2,1.6087*2,1.7537*2,1.8987*2,2.0438*2,2.1979*2],
  },

    // ========== 共鸣回路 ==========
  {
    name: "流变·月弓伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣回路",
    multiplierList: [1.2600,1.3634,1.4667,1.6113,1.7147,1.8335,1.9988,2.1641,2.3294,2.5051],
  },
  {
    name: "流变·月环伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣回路",
    multiplierList: [0.3983*4,0.4310*4,0.4636*4,0.5093*4,0.5420*4,0.5795*4,0.6318*4,0.6840*4,0.7363*4,0.7918*4],
  },
  {
    name: "月弓·普攻第一段强化伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣回路",
    multiplierList: [1.0360,1.1210,1.2060,1.3249,1.4098,1.5075,1.6435,1.7794,1.9153,2.0597],
  },
  {
    name: "月弓·普攻第二段强化伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣回路",
    multiplierList: [0.4800*3,0.5194*3,0.5588*3,0.6139*3,0.6532*3,0.6985*3,0.7615*3,0.8244*3,0.8874*3,0.9543*3],
  },
  {
    name: "月弓·普攻第三段强化伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣回路",
    multiplierList: [1.3400*2,1.4499*2,1.5598*2,1.7136*2,1.8235*2,1.9499*2,2.1257*2,2.3015*2,2.4773*2,2.6641*2],
  },
  {
    name: "月弓·闪避反击强化伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣回路",
    multiplierList: [0.7867*3,0.8512*3,0.9157*3,1.0060*3,1.0705*3,1.1447*3,1.2479*3,1.3511*3,1.4544*3,1.5640*3],
  },
  {
    name: "越限的弦引强化伤害",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣回路",
    multiplierList: [1.6055*2,1.7372*2,1.8689*2,2.0532*2,2.1848*2,2.3362*2,2.5469*2,2.7575*2,2.9681*2,3.1919*2],
  },
    
    // ========== 共鸣解放 ==========
  {
    name: "共鸣解放·溺失月海",
    skillLevel: 10,
    damageType: "共鸣解放",
    skillCategory: "共鸣解放",
    multiplierList: [5.5000,5.9510,6.4020,7.0334,7.4844,8.0031,8.7247,9.4463,10.1679,10.9346],
  },

    // ========== 变奏技能 ==========  
  {
    name: "变奏技能·照我以显",
    skillLevel: 10,
    damageType: "普攻",
    skillCategory: "变奏技能",
    multiplierList: [0.0800*7+0.2400,0.0866*7+0.2597,0.0932*7+0.2794,0.1024*7+0.3070,0.1089*7+0.3266,0.1165*7+0.3493,0.1270*7+0.3808,0.1374*7+0.4122,0.1479*7+0.4437,0.1591*7+0.4772],
  },
  ],
  
  branchStats: {
    branch1: { stat: "暴击率", value: 0.08 },
    branch2: { stat: "大攻击", value: 0.12 }
  },
  
  passiveSkills: [
    {
      name: "盈昇",
      description: "尤诺每次施放普攻、重击、闪避反击、共鸣技能、共鸣解放、变奏技能时，可获得1个基于自身攻击32%的护盾，持续15秒。该护盾在切换至其他角色时不会继承。",
      enabled: false,
      effects: {
        statBonus: { "伤害加深": 0.04 },
        conditional: {
          condition: "苍白死光的祝颂层数",
          values: [0, 0.04, 0.08, 0.12, 0.16, 0.20, 0.24, 0.28, 0.32, 0.36, 0.40] // 0-10层
        }
      },
      conditionalUI: {
        type: "slider",
        label: "苍白死光的祝颂层数",
        stateKey: "cangbaisiguangdezhusongStacks",
        min: 0,
        max: 10,
        suffix: "层"
      }
    }
  ]
};
    
